---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DpartLengthComputed
source: html/cb13a0c8-0819-7d1b-2d6f-f31ed74acf48.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DpartLengthComputed Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId DpartLengthComputed { get; }
```